#! -*- encoding:utf-8_-*-

names = (u"欧阳", u"太史", u"端木", u"上官", u"司马", u"东方", u"独孤", u"南宫", u"万俟", u"闻人", u"夏侯", u"诸葛",
u"尉迟", u"公羊", u"赫连", u"澹台", u"皇甫", u"宗政", u"濮阳", u"公冶", u"太叔", u"申屠", u"公孙", u"慕容", u"仲孙",
u"钟离", u"长孙", u"宇文", u"司徒", u"鲜于", u"司空", u"闾丘", u"子车", u"亓官", u"司寇", u"巫马", u"公西", u"颛孙",
u"壤驷", u"公良", u"漆雕", u"乐正", u"宰父", u"谷梁", u"拓跋", u"夹谷", u"轩辕", u"令狐", u"段干", u"百里", u"呼延",
u"东郭", u"南门", u"羊舌", u"微生", u"公户", u"公玉", u"公仪", u"梁丘", u"公仲", u"公上", u"公门", u"公山", u"公坚",
u"左丘", u"公伯", u"西门", u"公祖", u"第五", u"公乘", u"贯丘", u"公皙", u"南荣", u"东里", u"东宫", u"仲长", u"子书",
u"子桑", u"即墨", u"达奚", u"褚师") 

def is_surname(last_name):
    return last_name in names
